[
  {
    "title": "PAE Website",
    "description": "-Contributed to the development of the PAE website using Next.js, Tailwind CSS, HTML, JavaScript, and React, delivering a highly responsive user interface that improved page load times by 30% and user engagement by 20%. -Enhanced the site’s performance by optimizing code and assets, leading to a 20% reduction in load times. -Worked closely with cross functional teams to ensure the project met client specifications and was delivered on time.",
    "codeLink": "",
    "imageFile": "PAE.jpeg",
    "projectSite":""
  },
  {
    "title": "Now Yapı Website",
    "description": "Led the frontend development for the 'Now Yapi' project using React.js, Tailwind CSS, and Swiper, creating an intuitive and responsive user interface. -Implemented interactive image sliders with Swiper, enhancing the visual appeal and user engagement of the platform. -Managed JSON data integration for seamless communication between frontend and backend, improving data handling efficiency by 25%. -Collaborated with the design team to align UI/UX elements with the brand’s vision, resulting in a more cohesive and user friendly experience.",
    "codeLink": "",
    "imageFile": "NowYapı.jpeg",
    "projectSite":"https://nowyapi.com/"
  },
  {
    "title": "Blur Face",
    "description": "-Developed the frontend of a web application using React.js and Django, allowing users to apply image blurring effects to faces and objects. -Integrated responsive design principles to ensure cross device compatibility, resulting in a 30% increase in user retention. -Optimized performance by implementing efficient image processing algorithms, reducing processing time by 40%.",
    "codeLink": "https://github.com/hsemihaktas/BlurryFace",
    "imageFile": "BlurFace.png",
    "projectSite":""
  },
  {
    "title": "Riot Twitch Bot",
    "description": "-Developed a Twitch chatbot using Node.js and the Axios library to interact with the Riot Games API. -Provided real time in game data for League of Legends and Teamfight Tactics matches, enhancing viewer engagement and interaction on Twitch streams. -Integrated Twitch API to ensure seamless communication between the chatbot and Twitch chat, enabling instant data retrieval upon viewer requests. -Optimized API calls to reduce latency and improve the efficiency of data updates, ensuring that viewers receive the most accurate and up to date game information. -Collaborated with a team to design and implement features that meet the needs of Twitch streamers and their audiences, contributing to the overall success of the project.",
    "codeLink": "https://github.com/hsemihaktas/RiotTwitchBot",
    "imageFile": "RiotTwicthBot.png",
    "projectSite":""
  },
  {
    "title": "Riot Twitch Bot Website",
    "description": "-Designed and developed a website to showcase the RiotTwitchBot project, enhancing visibility and user engagement. -Utilized modern web development technologies such as React.js, HTML5, and CSS3 to create a responsive and visually appealing interface. -Implemented features that allow users to easily understand and interact with the RiotTwitchBot, fostering community interest and participation.",
    "codeLink": "https://github.com/hsemihaktas/RiotTwitchBotWebsite",
    "imageFile": "RiotTwitchBotWebsite.png",
    "projectSite":"https://riottwitchbot.vercel.app/"
  },
  {
    "title": "Property Website",
    "description": "-Created a full stack web application using React.js, Node.js, and MySQL, enabling users to manage property listings with ease. -Designed and implemented CRUD operations for property management, resulting in a 15% increase in platform usage. -Ensured data security and integrity by integrating robust authentication and authorization protocols, enhancing user trust and platform reliability.",
    "codeLink": "https://github.com/hsemihaktas/EstateWebsite",
    "imageFile": "EstateWebsite.png",
    "projectSite":""
  }
]
